app/views/admin/attendance_records/index.html.erb

SELECT "employees".* FROM "employees" WHERE "employees"."id" = 2
---
                      <div class="w-10 h-10 rounded-xl bg-gradient-to-br from-blue-500 to-purple-600 flex items-center justify-center text-white font-semibold text-sm">
                        <%= record.employee.first_name[0] %><%= record.employee.last_name[0] %>