app/controllers/api/v1/hrm/attendance_records_controller.rb

  def index
    unless current_employee
      return render json: { records: [], summary: { total_days: 0, present: 0, absent: 0, late: 0, total_hours: 0 } }
    end

    start_date = params[:start_date]&.to_date || Date.today.beginning_of_month
    end_date = params[:end_date]&.to_date || Date.today.end_of_month

    @attendance_records = current_employee.attendance_records
      .where(date: start_date..end_date)
      .order(date: :desc, clock_in: :desc)

    render json: {
      records: @attendance_records,
      summary: {
        total_days: @attendance_records.count,
        present: @attendance_records.where(status: "present").count,
        absent: @attendance_records.where(status: "absent").count,
        late: @attendance_records.where(status: "late").count,
        total_hours: calculate_total_hours(@attendance_records)
---
SELECT COUNT(*) FROM "attendance_records" WHERE "attendance_records"."employee_id" = 2 AND "attendance_records"."date" BETWEEN '2026-04-01' AND '2026-04-30' AND "attendance_records"."status" = 'present'