app/controllers/api/v1/hrm/attendance_records_controller.rb

SELECT "attendance_records".* FROM "attendance_records" WHERE "attendance_records"."employee_id" = 2 AND "attendance_records"."date" BETWEEN '2026-04-01' AND '2026-04-30' ORDER BY "attendance_records"."date" DESC, "attendance_records"."clock_in" DESC
SELECT COUNT(*) FROM "attendance_records" WHERE "attendance_records"."employee_id" = 2 AND "attendance_records"."date" BETWEEN '2026-04-01' AND '2026-04-30' AND "attendance_records"."status" = 'present'
---
  def index
    start_date = params[:start_date]&.to_date || Date.today.beginning_of_month
    end_date = params[:end_date]&.to_date || Date.today.end_of_month

    @attendance_records = current_employee.attendance_records
      .where(date: start_date..end_date)
      .order(date: :desc, clock_in: :desc)

    render json: {
      records: @attendance_records,
      summary: {
        total_days: @attendance_records.count,
        present: @attendance_records.where(status: "present").count,
        absent: @attendance_records.where(status: "absent").count,
        late: @attendance_records.where(status: "late").count,
        total_hours: calculate_total_hours(@attendance_records)

SELECT "attendance_records".* FROM "attendance_records" WHERE "attendance_records"."employee_id" = 2 AND "attendance_records"."clock_out" IS NOT NULL ORDER BY "attendance_records"."id" DESC LIMIT 1
---
  def current_status
    if AttendanceRecord.has_active_session?(current_employee.id)
      session = AttendanceRecord.current_session(current_employee.id)
      render json: {
        status: "clocked_in",
        clock_in: session.clock_in,
        date: session.date,
        duration: session.duration,
        record: session
      }
    else
      render json: {
        status: "clocked_out",
        last_clock_out: current_employee.attendance_records.completed.last&.clock_out

SELECT 1 AS one FROM "attendance_records" WHERE "attendance_records"."employee_id" = 2 AND "attendance_records"."date" = '2026-04-20' LIMIT 1
INSERT INTO "attendance_records" ("employee_id", "user_id", "clock_in", "clock_out", "date", "status", "ip_address", "created_at", "updated_at") VALUES (2, 1, '2026-04-20 14:48:55.713279', NULL, '2026-04-20', 'late', '::1', '2026-04-20 14:48:55.720619', '2026-04-20 14:48:55.720619') RETURNING "id"
---
  def clock_in
    if AttendanceRecord.has_active_session?(current_employee.id)
      return render json: {
        error: "You already have an active session",
        code: "ALREADY_CLOCKED_IN"
      }, status: :unprocessable_entity
    end

    today = Date.today

    if current_employee.attendance_records.where(date: today).exists?
      return render json: {
        error: "You have already clocked in today",
        code: "ALREADY_CLOCKED_IN_TODAY"
      }, status: :unprocessable_entity
    end

    @attendance_record = current_employee.attendance_records.new(
      clock_in: Time.current,
      date: today,
      ip_address: request.remote_ip,
      user_id: current_user.id,
      status: determine_status
    )

    if @attendance_record.save

UPDATE "attendance_records" SET "clock_out" = '2026-04-20 15:07:13.789509', "ip_address" = '::1', "updated_at" = '2026-04-20 15:07:13.789839' WHERE "attendance_records"."id" = 2
---
  def clock_out
    session = AttendanceRecord.current_session(current_employee.id)

    unless session
      return render json: {
        error: "No active clock-in session found",
        code: "NO_ACTIVE_SESSION"
      }, status: :not_found
    end

    clock_out_time = Time.current

    if clock_out_time < session.clock_in
      return render json: {
        error: "Clock-out time cannot be before clock-in time",
        code: "INVALID_CLOCK_OUT"
      }, status: :unprocessable_entity
    end

    session.assign_attributes(
      clock_out: clock_out_time,
      ip_address: request.remote_ip
    )

    if session.save