app/controllers/api/v1/hrm/attendance_records_controller.rb

SELECT 1 AS one FROM "attendance_records" WHERE "attendance_records"."employee_id" = 2 AND "attendance_records"."date" = '2026-04-20' AND "attendance_records"."clock_out" IS NULL LIMIT 1
SELECT "attendance_records".* FROM "attendance_records" WHERE "attendance_records"."employee_id" = 2 AND "attendance_records"."clock_out" IS NOT NULL ORDER BY "attendance_records"."id" DESC LIMIT 1
---
  def clock_in
    if current_employee.attendance_records.where(date: Date.today, clock_out: nil).exists?

SELECT "attendance_records".* FROM "attendance_records" WHERE "attendance_records"."clock_out" IS NULL AND "attendance_records"."employee_id" = 2 AND "attendance_records"."date" = '2026-04-20' ORDER BY "attendance_records"."id" DESC LIMIT 1
---
  def clock_out
    @attendance_record = current_employee.attendance_records.where(date: Date.today, clock_out: nil).last