app/controllers/api/v1/hrm/enrollments_controller.rb

  def index
    @enrollments = current_employee.enrollments.includes(:training_course).order(created_at: :desc)
---
SELECT "enrollments".* FROM "enrollments" WHERE "enrollments"."employee_id" = $1 ORDER BY "enrollments"."created_at" DESC  [["employee_id", 1]]

  def show
    @enrollment = current_employee.enrollments.find(params[:id])
---
SELECT "enrollments".* FROM "enrollments" WHERE "enrollments"."employee_id" = $1 AND "enrollments"."id" = $2 LIMIT $3  [["employee_id", 1], ["id", 1], ["LIMIT", 1]]