app/controllers/api/v1/hrm/leave_requests_controller.rb

  def index
    @leave_requests = current_employee.leave_requests.order(start_date: :desc)
---
SELECT "leave_requests".* FROM "leave_requests" WHERE "leave_requests"."employee_id" = $1 ORDER BY "leave_requests"."start_date" DESC  [["employee_id", 1]]

  def create
    @leave_request = current_employee.leave_requests.new(leave_request_params)
    @leave_request.status = "pending"

    if @leave_request.save
---
INSERT INTO "leave_requests" ("approved_by_id", "created_at", "employee_id", "end_date", "leave_type", "reason", "start_date", "status", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

  def show
    @leave_request = current_employee.leave_requests.find(params[:id])
---
SELECT "leave_requests".* FROM "leave_requests" WHERE "leave_requests"."employee_id" = $1 AND "leave_requests"."id" = $2 LIMIT $3  [["employee_id", 1], ["id", 1], ["LIMIT", 1]]