app/controllers/api/v1/hrm/performance_reviews_controller.rb

  def index
    @reviews = current_employee.performance_reviews.order(review_date: :desc)
---
SELECT "performance_reviews".* FROM "performance_reviews" WHERE "performance_reviews"."employee_id" = $1 ORDER BY "performance_reviews"."review_date" DESC  [["employee_id", 1]]

  def show
    @review = current_employee.performance_reviews.find(params[:id])
---
SELECT "performance_reviews".* FROM "performance_reviews" WHERE "performance_reviews"."employee_id" = 2 AND "performance_reviews"."id" = 1 LIMIT 1