app/controllers/api/v1/hrm/timesheets_controller.rb

  def index
    @timesheets = current_employee.timesheets.order(date: :desc)
---
SELECT "timesheets".* FROM "timesheets" WHERE "timesheets"."employee_id" = $1 ORDER BY "timesheets"."date" DESC  [["employee_id", 1]]