app/controllers/api/v1/hrm/training_courses_controller.rb

SELECT "training_courses".* FROM "training_courses" WHERE "training_courses"."is_active" = $1 ORDER BY "training_courses"."title" ASC  [["is_active", true]]
---
  def index
    @courses = TrainingCourse.where(is_active: true).order(title: :asc)

SELECT "training_courses".* FROM "training_courses" WHERE "training_courses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @course = TrainingCourse.find(params[:id])

SELECT "training_courses".* FROM "training_courses" WHERE "training_courses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def enroll
    @course = TrainingCourse.find(params[:id])