app/controllers/admin/attendance_records_controller.rb

  def index
    @attendance_records = AttendanceRecord.includes(:employee, :user).order(date: :desc)
---
SELECT "attendance_records".* FROM "attendance_records" ORDER BY "attendance_records"."date" DESC

  def new
    @attendance_record = AttendanceRecord.new
    @employees = Employee.all
---
SELECT "employees".* FROM "employees"

  def create
    @attendance_record = AttendanceRecord.new(attendance_record_params)
    if @attendance_record.save
---
INSERT INTO "attendance_records" ("employee_id", "user_id", "clock_in", "clock_out", "date", "status", "ip_address", "created_at", "updated_at") VALUES (2, NULL, '2026-04-20 05:54:00', NULL, '2026-04-20', 'absent', '', '2026-04-20 14:53:11.177932', '2026-04-20 14:53:11.177932') RETURNING "id"

  def destroy
    @attendance_record.destroy
---
DELETE FROM "attendance_records" WHERE "attendance_records"."id" = 1

  def set_attendance_record
    @attendance_record = AttendanceRecord.find(params[:id])
---
SELECT "attendance_records".* FROM "attendance_records" WHERE "attendance_records"."id" = 2 LIMIT 1