app/controllers/admin/clients_controller.rb

  def index
    @clients = Client.all.order(created_at: :desc)
---
SELECT "clients".* FROM "clients" ORDER BY "clients"."created_at" DESC

  def set_client
    @client = Client.find(params[:id])
---
SELECT "clients".* FROM "clients" WHERE "clients"."id" = 6 LIMIT 1