app/controllers/admin/dashboard_controller.rb

SELECT COUNT(*) FROM "employees"
SELECT COUNT(*) FROM "vendors"
SELECT COUNT(*) FROM "clients"
SELECT COUNT(*) FROM "shipments"
SELECT COUNT(*) FROM "invoices"
SELECT SUM("invoices"."amount") FROM "invoices" WHERE "invoices"."status" = 'paid'
SELECT COUNT(*) FROM "invoices" WHERE "invoices"."status" = 'pending'
SELECT "shipments".* FROM "shipments" ORDER BY "shipments"."created_at" DESC LIMIT 5
---
  def index
    @employees_count = Employee.count
    @vendors_count = Vendor.count
    @clients_count = Client.count
    @shipments_count = Shipment.count
    @invoices_count = Invoice.count
    @total_revenue = Invoice.where(status: "paid").sum(:amount) || 0
    @pending_invoices = Invoice.where(status: "pending").count
    @recent_shipments = Shipment.order(created_at: :desc).limit(5)