app/controllers/admin/employees_controller.rb

SELECT "employees".* FROM "employees" ORDER BY "employees"."created_at" DESC
---
  def index
    @employees = Employee.all.order(created_at: :desc)

SELECT "employees".* FROM "employees" WHERE "employees"."id" = 1 LIMIT 1
---
  def show
    @employee = Employee.find(params[:id])

INSERT INTO "employees" ("first_name", "last_name", "email", "phone", "position", "department", "salary", "hire_date", "created_at", "updated_at") VALUES ('Natalie', 'Knight', 'knightnatalie7@gmail.com', '0795071651', 'Admin', 'friend', 20000.0, '2026-04-07', '2026-04-14 12:56:51.346700', '2026-04-14 12:56:51.346700') RETURNING "id"
---
  def create
    @employee = Employee.new(employee_params)
    if @employee.save

SELECT "employees".* FROM "employees" WHERE "employees"."id" = 1 LIMIT 1
---
  def edit
    @employee = Employee.find(params[:id])

SELECT "employees".* FROM "employees" WHERE "employees"."id" = 2 LIMIT 1
UPDATE "employees" SET "position" = 'Admin', "updated_at" = '2026-04-14 13:51:41.168640' WHERE "employees"."id" = 2
---
  def update
    @employee = Employee.find(params[:id])
    if @employee.update(employee_params)

SELECT "employees".* FROM "employees" WHERE "employees"."id" = 1 LIMIT 1
DELETE FROM "employees" WHERE "employees"."id" = 1
---
  def destroy
    @employee = Employee.find(params[:id])
    @employee.destroy

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  def current_user
    @current_user ||= User.find_by(id: session[:user_id]) if session[:user_id]