app/controllers/admin/hrm_dashboard_controller.rb

SELECT COUNT(*) FROM "employees"
SELECT COUNT(*) FROM "users" WHERE "users"."role" IN ('employee', 'hr_manager')
SELECT COUNT(*) FROM "leave_requests" WHERE "leave_requests"."status" = 'pending'
SELECT COUNT(*) FROM "timesheets" WHERE "timesheets"."status" = 'pending'
SELECT COUNT(*) FROM "attendance_records" WHERE "attendance_records"."date" = '2026-04-15'
SELECT COUNT(*) FROM "tasks" WHERE "tasks"."status" != 'done'
SELECT COUNT(*) FROM "training_courses" WHERE "training_courses"."is_active" = TRUE
SELECT COUNT(*) FROM "performance_reviews"
---
  def index
    @total_employees = Employee.count
    @total_users = User.where(role: [ "employee", "hr_manager" ]).count
    @pending_leaves = LeaveRequest.where(status: "pending").count
    @pending_timesheets = Timesheet.where(status: "pending").count
    @attendance_today = AttendanceRecord.where(date: Date.today).count
    @active_tasks = Task.where.not(status: "done").count
    @training_courses = TrainingCourse.where(is_active: true).count
    @performance_reviews = PerformanceReview.count