app/controllers/admin/invoices_controller.rb

  def index
    @invoices = Invoice.all.order(created_at: :desc)
---
SELECT "invoices".* FROM "invoices" ORDER BY "invoices"."created_at" DESC

  def show
    @invoice = Invoice.find(params[:id])
---
SELECT "invoices".* FROM "invoices" WHERE "invoices"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]

  def new
    @invoice = Invoice.new
    @vendors = Vendor.all
---
SELECT "vendors".* FROM "vendors"

  def create
    @invoice = Invoice.new(invoice_params)
    if @invoice.save
---
INSERT INTO "invoices" ("amount", "created_at", "due_date", "invoice_number", "paid_date", "status", "updated_at", "user_id", "vendor_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def edit
    @invoice = Invoice.find(params[:id])
    @vendors = Vendor.all
---
SELECT "invoices".* FROM "invoices" WHERE "invoices"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]
SELECT "vendors".* FROM "vendors"

  def update
    @invoice = Invoice.find(params[:id])
---
SELECT "invoices".* FROM "invoices" WHERE "invoices"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]

  def destroy
    @invoice = Invoice.find(params[:id])
    @invoice.destroy
---
SELECT "invoices".* FROM "invoices" WHERE "invoices"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]
DELETE FROM "invoices" WHERE "invoices"."id" = $1  [["id", 980190962]]