app/controllers/admin/leave_requests_controller.rb

  def new
    @leave_request = LeaveRequest.new
    @employees = Employee.all
---
SELECT "employees".* FROM "employees"