app/controllers/admin/performance_reviews_controller.rb

  def index
    @performance_reviews = PerformanceReview.includes(:employee, :reviewer).order(created_at: :desc)
---
SELECT "performance_reviews".* FROM "performance_reviews" ORDER BY "performance_reviews"."created_at" DESC

  def new
    @performance_review = PerformanceReview.new
    @employees = Employee.all
---
SELECT "employees".* FROM "employees"

  def create
    @performance_review = PerformanceReview.new(performance_review_params)
    if @performance_review.save
---
INSERT INTO "performance_reviews" ("employee_id", "reviewer_id", "rating", "feedback", "review_cycle", "review_date", "status", "created_at", "updated_at") VALUES (2, NULL, 5, 'Good employee ', 'Q1 2026', '2026-04-16', 'completed', '2026-04-16 11:43:14.767603', '2026-04-16 11:43:14.767603') RETURNING "id"

  def set_performance_review
    @performance_review = PerformanceReview.find(params[:id])
---
SELECT "performance_reviews".* FROM "performance_reviews" WHERE "performance_reviews"."id" = 1 LIMIT 1