app/controllers/admin/shipments_controller.rb

  def index
    @shipments = Shipment.all.order(created_at: :desc)
---
SELECT "shipments".* FROM "shipments" ORDER BY "shipments"."created_at" DESC

  def show
    @shipment = Shipment.find(params[:id])
---
SELECT "shipments".* FROM "shipments" WHERE "shipments"."id" = 1 LIMIT 1

  def create
    @shipment = Shipment.new(shipment_params)
    if @shipment.save
---
INSERT INTO "shipments" ("container_number", "booking_reference", "origin", "destination", "status", "ship_date", "estimated_arrival", "created_at", "updated_at") VALUES ('2223333', '23232', '2323', '2323', 'in_transit', '2026-04-30', '2026-04-28', '2026-04-15 08:20:07.656252', '2026-04-15 08:20:07.656252') RETURNING "id"

  def edit
    @shipment = Shipment.find(params[:id])
---
SELECT "shipments".* FROM "shipments" WHERE "shipments"."id" = 1 LIMIT 1

  def update
    @shipment = Shipment.find(params[:id])
---
SELECT "shipments".* FROM "shipments" WHERE "shipments"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]

  def destroy
    @shipment = Shipment.find(params[:id])
    @shipment.destroy
---
SELECT "shipments".* FROM "shipments" WHERE "shipments"."id" = 1 LIMIT 1
DELETE FROM "shipments" WHERE "shipments"."id" = 1