app/controllers/admin/users_controller.rb

  def index
    @users = User.all.order(created_at: :desc)
---
SELECT "users".* FROM "users" ORDER BY "users"."created_at" DESC

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("email", "password_digest", "first_name", "last_name", "role", "must_update_password", "created_at", "updated_at") VALUES ('felender23@gmail.com', '$2a$12$5l1Jgv.fwgU0vbNxX2Gy6.1gJw7lmKgmYiAD3Sp8ulAKExkRz3Y0K', 'Natalie', 'Knight', 'user', TRUE, '2026-04-14 13:48:44.106258', '2026-04-14 13:48:44.106258') RETURNING "id"

  def update
    @user = User.find(params[:id])
    if @user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = 4 LIMIT 1
UPDATE "users" SET "first_name" = 'Tlangelani', "updated_at" = '2026-04-15 15:24:52.457112' WHERE "users"."id" = 4