app/controllers/admin/vendors_controller.rb

  def index
    @vendors = Vendor.all.order(created_at: :desc)
---
SELECT "vendors".* FROM "vendors" ORDER BY "vendors"."created_at" DESC

  def show
    @vendor = Vendor.find(params[:id])
---
SELECT "vendors".* FROM "vendors" WHERE "vendors"."id" = 1 LIMIT 1

  def create
    @vendor = Vendor.new(vendor_params)
    @vendor.user = current_user
    if @vendor.save
---
INSERT INTO "vendors" ("name", "email", "phone", "address", "bank_reference", "status", "created_at", "updated_at") VALUES ('Red Transport Company (Pty) Ltd ', 'info@redtrucks.co.za', '071 170 6153', '1 Orion Rd, Brackenfell, Cape Town, 7561, South Africa', '203 067 533', 'active', '2026-04-20 08:36:01.175771', '2026-04-20 08:36:01.175771') RETURNING "id"

  def edit
    @vendor = Vendor.find(params[:id])
---
SELECT "vendors".* FROM "vendors" WHERE "vendors"."id" = 1 LIMIT 1

  def update
    @vendor = Vendor.find(params[:id])
    if @vendor.update(vendor_params)
---
SELECT "vendors".* FROM "vendors" WHERE "vendors"."id" = 3
UPDATE "vendors" SET "updated_at" = '2026-04-20 12:36:16.367029', "registration_number" = '200922', "kyc_status" = 'in_progress', "risk_score" = 80, "fica_compliant" = TRUE, "aml_checked" = TRUE, "sanctions_screened" = TRUE, "bank_verified" = TRUE, "beneficial_ownership_declared" = TRUE, "contract_start_date" = '2026-04-20', "contract_end_date" = '2027-10-20', "sla_details" = 'A Service Level Agreement (SLA) defines specific performance metrics, such as 99.9% uptime, 1-hour response times, and resolution targets for IT services. It includes agreed-upon service levels, responsibilities, and penalties (like monetary credits) for underperformance, ensuring accountability for both parties' WHERE "vendors"."id" = 3

  def destroy
    @vendor = Vendor.find(params[:id])
    @vendor.destroy
---
SELECT "vendors".* FROM "vendors" WHERE "vendors"."id" = 1 LIMIT 1
DELETE FROM "vendors" WHERE "vendors"."id" = 1