app/views/admin/employees/_form.html.erb

SELECT "users".* FROM "users" ORDER BY "users"."email" ASC
---
        <%= form.label :user_id, "Associate User Account", class: "block text-slate-300 text-sm font-medium mb-2" %>
        <%= form.collection_select :user_id, User.order(:email), :id, :email, { include_blank: "Select User" }, class: "w-full px-4 py-2 bg-slate-900 border border-slate-600 rounded-lg text-slate-100 focus:border-blue-500 focus:ring-1 focus:ring-blue-500 outline-none" %>