app/views/admin/warehouse/locations/show.html.erb

      <span class="text-slate-300 text-sm">Inventory Count</span>
      <span class="text-slate-100 font-bold"><%= @location.inventory_records.sum(:quantity) %> units</span>
---
SELECT SUM("inventory_records"."quantity") FROM "inventory_records" WHERE "inventory_records"."warehouse_location_id" = 1

       <label class="block text-slate-500 text-[10px] font-black mb-1">Pallet Count</label>
       <p class="text-slate-200 font-bold"><%= @location.pallets.count %></p>
---
SELECT COUNT(*) FROM "pallets" WHERE "pallets"."warehouse_location_id" = 1

   <span class="px-3 py-1 bg-slate-900 border border-slate-700 rounded-lg text-xs font-bold text-slate-400">
    <%= @location.inventory_records.count %> line items
---
SELECT COUNT(*) FROM "inventory_records" WHERE "inventory_records"."warehouse_location_id" = 1

  <div class="p-0">
   <% if @location.inventory_records.any? %>
---
SELECT 1 AS one FROM "inventory_records" WHERE "inventory_records"."warehouse_location_id" = 1 LIMIT 1