app/controllers/admin/warehouse/dashboard_controller.rb

SELECT SUM("warehouse_locations"."capacity_volume") FROM "warehouse_locations"
SELECT SUM("warehouse_locations"."current_volume") FROM "warehouse_locations"
SELECT "inventory_items".* FROM "inventory_items" LIMIT 10
---
  def index
    @locations = WarehouseLocation.all
    @total_capacity_vol = @locations.sum(:capacity_volume)
    @current_vol = @locations.sum(:current_volume)
    @utilization = @total_capacity_vol > 0 ? (@current_vol / @total_capacity_vol * 100).round(2) : 0

    @recent_transactions = WarehouseTransaction.order(created_at: :desc).limit(10)
    @inventory_summary = InventoryItem.all.limit(10)