app/controllers/admin/warehouse/inventory_controller.rb

SELECT "inventory_records".* FROM "inventory_records"
---
  def index
    @inventory_records = InventoryRecord.includes(:inventory_item, :client, :warehouse_location).all

SELECT "inventory_items".* FROM "inventory_items"
SELECT "clients".* FROM "clients"
SELECT "warehouse_locations".* FROM "warehouse_locations" WHERE "warehouse_locations"."is_full" = FALSE
---
  def new
    @inventory_record = InventoryRecord.new
    @items = InventoryItem.all
    @clients = Client.all
    @locations = WarehouseLocation.where(is_full: false)

INSERT INTO "inventory_records" ("inventory_item_id", "client_id", "warehouse_location_id", "pallet_id", "quantity", "batch_number", "expiry_date", "created_at", "updated_at") VALUES (2, 4, 9, NULL, 22, 'BATCH-001', '2026-04-30', '2026-04-23 08:38:24.893103', '2026-04-23 08:38:24.893103') RETURNING "id"
SELECT "inventory_items".* FROM "inventory_items"
SELECT "clients".* FROM "clients"
SELECT "warehouse_locations".* FROM "warehouse_locations" WHERE "warehouse_locations"."is_full" = FALSE
---
  def create
    @inventory_record = InventoryRecord.new(inventory_params)
    if @inventory_record.save
      # Log transaction
      WarehouseTransaction.create!(
        transaction_type: 'receiving',
        inventory_item: @inventory_record.inventory_item,
        client: @inventory_record.client,
        to_location: @inventory_record.warehouse_location,
        quantity: @inventory_record.quantity,
        user: current_user
      )
      redirect_to admin_warehouse_inventory_index_path, notice: "Stock received successfully."
    else
      @items = InventoryItem.all
      @clients = Client.all
      @locations = WarehouseLocation.where(is_full: false)