app/controllers/admin/warehouse/inventory_controller.rb

  def set_form_data
    @items = InventoryItem.all.order(:name)
    @clients = Client.all.order(:name)
    @locations = WarehouseLocation.all.order(:name)
---
SELECT "inventory_items".* FROM "inventory_items" ORDER BY "inventory_items"."name" ASC
SELECT "clients".* FROM "clients" ORDER BY "clients"."name" ASC
SELECT "warehouse_locations".* FROM "warehouse_locations" ORDER BY "warehouse_locations"."name" ASC