app/controllers/admin/warehouse/items_controller.rb

  def index
    @items = InventoryItem.all.order(:name)
---
SELECT "inventory_items".* FROM "inventory_items" ORDER BY "inventory_items"."name" ASC