app/controllers/admin/warehouse/locations_controller.rb

  def index
    @locations = WarehouseLocation.all.order(:name)
---
SELECT "warehouse_locations".* FROM "warehouse_locations" ORDER BY "warehouse_locations"."name" ASC

  def create
    @location = WarehouseLocation.new(location_params)
    @location.user = current_user
    if @location.save
---
INSERT INTO "warehouse_locations" ("name", "zone", "location_type", "capacity_volume", "current_volume", "capacity_weight", "current_weight", "is_full", "created_at", "updated_at") VALUES ('ZONE-A ))!', 'Dangerous Goods', 'receiving', 5.0, 0.0, 30.0, 0.0, FALSE, '2026-04-23 07:01:27.168101', '2026-04-23 07:01:27.168101') RETURNING "id"

  def set_location
    @location = WarehouseLocation.find(params[:id])
---
SELECT "warehouse_locations".* FROM "warehouse_locations" WHERE "warehouse_locations"."id" = 1 LIMIT 1