app/views/admin/invoices/index.html.erb

SELECT "invoices".* FROM "invoices" ORDER BY "invoices"."created_at" DESC
SELECT "vendors".* FROM "vendors" WHERE "vendors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      <table><thead><tr><th>Invoice #</th><th>Vendor</th><th>Amount</th><th>Status</th><th>Due Date</th><th>Actions</th></tr></thead><tbody>
        <% @invoices.each do |i| %><tr><td><strong><%= i.invoice_number %></strong></td><td><%= i.vendor ? i.vendor.name : '-' %></td><td>R<%= number_with_delimiter(i.amount.round(2)) %></td><td><span class="badge <%= i.status=='paid'?'badge-success':i.status=='pending'?'badge-warning':'badge-error' %>"><%= i.status||'pending' %></span></td><td><%= i.due_date ? i.due_date.strftime('%Y-%m-%d') : '-' %></td><td><div class="actions"><a href="<%= admin_invoice_path(i) %>" class="btn btn-sm btn-secondary">View</a><a href="<%= edit_admin_invoice_path(i) %>" class="btn btn-sm btn-secondary">Edit</a><%= button_to 'Delete', admin_invoice_path(i), method: :delete, data: { confirm: 'Sure?' }, class: 'btn btn-sm btn-danger' %></div></td></tr><% end %></tbody></table>