app/views/admin/performance_reviews/index.html.erb

                      <div class="w-10 h-10 rounded-xl bg-gradient-to-br from-blue-500 to-purple-600 flex items-center justify-center text-white font-semibold text-sm">
                        <%= review.employee.first_name[0] %><%= review.employee.last_name[0] %>
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = 2