app/views/admin/performance_reviews/new.html.erb

            <label class="block text-slate-300 text-sm font-medium mb-2.5">Reviewer</label>
            <%= form.collection_select :reviewer_id, User.all, :id, ->(u) { "#{u.first_name} #{u.last_name}" }, { prompt: 'Select Reviewer' }, class: "w-full px-4 py-3 bg-slate-900 border border-slate-600 rounded-lg text-slate-100 focus:outline-none focus:border-blue-500" %>
---
SELECT "users".* FROM "users"