app/controllers/api/v1/auth_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'felender7@gmail.com' LIMIT 1
---
  def login
    user = User.find_by(email: params[:email])

UPDATE "users" SET "password_digest" = '$2a$12$6CfHJ0rB8sgFX4B.hMWkFeG.BrFTMbgE2vsxQH3oNEWus0tSx88.K', "must_update_password" = FALSE, "updated_at" = '2026-04-14 13:58:38.148255' WHERE "users"."id" = 2
---
  def update_password
    if current_user.authenticate(params[:current_password])
      if current_user.update(password: params[:new_password], password_confirmation: params[:new_password_confirmation], must_update_password: false)