app/controllers/api/v1/dashboard_controller.rb

SELECT COUNT(*) FROM "shipments" WHERE "shipments"."status" NOT IN ('delivered', 'cancelled')
SELECT SUM("invoices"."amount") FROM "invoices" WHERE "invoices"."status" = 'paid'
---
  def stats
    render json: {
      employees: Employee.count,
      activeShipments: Shipment.where.not(status: ["delivered", "cancelled"]).count,
      revenue: Invoice.where(status: "paid").sum(:amount),
      vendors: Vendor.count