app/controllers/api/v1/logistics_controller.rb

  def create_booking
    booking = {
      id: Time.now.to_i,
      booking_number: "BK-2026-#{rand(100..999)}",
      vendor_name: Vendor.find_by(id: params[:vendor_id])&.name || "Unknown",
      origin: params[:origin],
      destination: params[:destination],
      container_type: params[:container_type] || "20ft",
      status: "pending",
      created_at: Date.today.to_s
---
SELECT "vendors".* FROM "vendors" WHERE "vendors"."id" = 2 LIMIT 1