app/controllers/api/v1/vendors_controller.rb

SELECT "vendors".* FROM "vendors" WHERE "vendors"."id" = NULL LIMIT 1
---
  def set_vendor
    @vendor = Vendor.find(params[:id])