app/controllers/api/v1/vendors_controller.rb

SELECT COUNT(*) FROM "vendors"
SELECT COUNT(*) FROM "vendors" WHERE "vendors"."status" = 'active'
SELECT COUNT(*) FROM "vendors" WHERE "vendors"."kyc_status" = 'pending'
SELECT "vendors".* FROM "vendors"
SELECT AVG("vendors"."risk_score") FROM "vendors"
SELECT COUNT(*) FROM "vendors" WHERE (contract_end_date >= '2026-04-20')
---
  def stats
    total = Vendor.count
    active = Vendor.where(status: "active").count
    pending = Vendor.where(kyc_status: "pending").count

    avg_risk = Vendor.average(:risk_score).to_f.round(1)
    active_contracts = Vendor.where("contract_end_date >= ?", Date.today).count

SELECT "vendors".* FROM "vendors"
SELECT COUNT(*) FROM "vendors" WHERE (name ILIKE '%undefined%' OR email ILIKE '%undefined%' OR phone ILIKE '%undefined%' OR bank_reference ILIKE '%undefined%') AND "vendors"."category" = 'Shipping lines' AND "vendors"."status" = 'undefined' AND "vendors"."kyc_status" = 'undefined'
SELECT "vendors".* FROM "vendors" WHERE (name ILIKE '%undefined%' OR email ILIKE '%undefined%' OR phone ILIKE '%undefined%' OR bank_reference ILIKE '%undefined%') AND "vendors"."category" = 'undefined' AND "vendors"."status" = 'undefined' AND "vendors"."kyc_status" = 'undefined' LIMIT 20 OFFSET 0
SELECT COUNT(*) FROM "vendors" WHERE (contract_end_date >= '2026-04-20')
---
  def index
    @vendors = Vendor.all

    @vendors = @vendors.search_by(params[:search]) if params[:search].present?
    @vendors = @vendors.filter_by_category(params[:category]) if params[:category].present?
    @vendors = @vendors.filter_by_status(params[:status]) if params[:status].present?
    @vendors = @vendors.filter_by_kyc_status(params[:kyc_status]) if params[:kyc_status].present?

    page = params[:page].to_i.positive? ? params[:page].to_i : 1
    per_page = params[:per_page].to_i.positive? ? params[:per_page].to_i : 20

    total = @vendors.count
    total_pages = (total.to_f / per_page).ceil
    @vendors = @vendors.offset((page - 1) * per_page).limit(per_page)

INSERT INTO "vendors" ("address", "bank_reference", "created_at", "email", "name", "phone", "status", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @vendor = Vendor.new(vendor_params)
    @vendor.user = current_user
    if @vendor.save

SELECT "vendors".* FROM "vendors" WHERE "vendors"."id" = 2 LIMIT 1
---
  def set_vendor
    @vendor = Vendor.find(params[:id])