app/controllers/admin_controller.rb

  def login
    if request.post?
      user = User.find_by(email: params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'felender7@gmail.com' LIMIT 1