app/controllers/concerns/authentication.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
---
  def authenticate_request
    token = extract_token
    return render_unauthorized("Missing token") if token.nil?

    payload = JsonWebToken.decode(token)
    return render_unauthorized("Invalid token") if payload.nil?

    @current_user = User.find_by(id: payload[:sub])